* TODO Call about a credit card
* TODO Gather all quote info into a real quote
  CLOCK: [2015-05-19 Tue 11:17]--[2015-05-19 Tue 14:07] =>  2:50
* TODO Review server info  
* TODO Review MSA 
  CLOCK: [2015-05-28 Thu 11:45]--[2015-05-28 Thu 11:45] =>  0:00
** TODO Understand Insurance
** TODO Understand Intellectual Property   
* TODO update data-template
** TODO write tests for data-template  
* TODO Fix cobalt kiosk backend to use forms for indexing
* TODO fix input-type thing
   CLOCK: [2015-05-28 Thu 01:12]--[2015-05-28 Thu 01:12] =>  0:00
   CLOCK: [2015-05-26 Tue 20:47]--[2015-05-27 Wed 06:47] => 10:00
   CLOCK: [2015-05-25 Mon 23:22]--[2015-05-25 Mon 23:52] =>  0:30
* TODO Figure out projects for Darren
** TODO Sandbox minimal build
** TODO Saucelabs project ??
* TODO Cobalt Form Features and Tasks
** TODO Add some way of culling fields unwanted for display
** TODO Add excel spreadsheet output
** TODO Add some form of type to prepare an invoice
* DONE Why aren't angular widgets
